import { Footer, Quote, SimilarArticles, TopNavigationBar } from "../components"

function ArticleDetail() {
    return (
        <div dir="rtl">
            <TopNavigationBar />

            <img
                alt=""
                loading="eager"
                src="/images/article-banner.png"
                className="w-full h-auto"
            />

            <div className="w-full max-w-3xl mx-auto mt-7 space-y-10">
                <div className="space-y-5">
                    <h2 className="text-3xl font-semibold text-black/90">
                        چرا یک هفته 7 روز دارد؟
                    </h2>

                    <p className="mt-4 text-sm text-black/80">
                        فقط یک چیز وجود دارد که هر فرهنگ ، دین و کشور در جهان با آن موافق است؟و این است که فقط هفت روز در هفته وجود دارد.نه یک مورد دیگر یا نهدلیل اینکه ما زندگی خود را در حدود یک هفته 7 روزه سازماندهی می کنیم ، کاملاً به معنای واقعی کلمه ، بالای سر ما است.مانند بسیاری از تقویم های دیگر ، تقویم گرگوری امروز در نهایت بر اساس مراحل ماه است.ماه طول می کشد تا ماه 29.5 روز چرخه در تمام مراحل ماه داشته باشد.برای اهداف روزمره ، این یک بازه زمانی نسبتاً طولانی و غیر عملی است ، بنابراین منطقی است که آن را به بخش های کوچکتر تقسیم کنیم.
                    </p>

                    <p className="mt-4 text-sm text-black/80">
                        وارد بابل ها شوید.این جامعه باستان ، که در بین النهرین در عراق زندگی می کرد ، چرخه ماه را تا 28 روز دور می کرد و این مدت زمان را به 4 دوره 7 روز تقسیم می کرد و از روزهای جهش برای همگام سازی با مراحل ماه در طولانی مدت استفاده می کردواداین ساختار 7 روزه همچنین اعتقاد بر این است که در نهایت تعدادی از اسطوره های آفرینش محبوب مانند کتاب پیدایش در کتاب مقدس عبری و مسیحی را آگاه کرده است ، که بیان می کند که خداوند جهان را در هفت روز ایجاد کرده است: شش روز کار به دنبال آن یکروز استراحت.
                    </p>
                </div>

                <div className="space-y-5">
                    <h2 className="text-xl font-medium">
                        📌 به نام خدایان و سیارات نامگذاری شده است
                    </h2>

                    <p className="mt-4 text-sm text-black/80">
                        هزاران سال پیش هیچ آیفون یا ساعت برای گفتن زمان وجود نداشت.بنابراین آنها به سیاره و مواضع خود نگاه می کنند تا آن را حدس بزنند!آنها هفت سیاره از جمله خورشید و ماه را دیدند.باور کنید که هرکدام ابرقدرت داشتند.بنابراین آنها شروع به پرستش آنها کردند.یک سیاره خدای عدالت خواهد بود ، یک سیاره خدای عشق خواهد بود.و دقیقاً مانند آن ، هر سیاره به یک خدا تبدیل می شود.آنها می خواستند که این خدا 24/7 مراقب آنها باشد.بنابراین آنها خدا را به هر ساعت از روز اختصاص می دهند.و سرانجام ، آنها حتی یک روز کامل به هر یک دادند.و اینگونه است که ما با 7 روز برای 7 خدا به پایان رسیدیم.
                    </p>
                </div>


                <Quote
                    text="مسیحیان ، مسلمانان ، یهودیان ، اروپایی ها ، عرب ها ، آسیایی ها و چین تا قطب جنوب همه 7 روز در هفته دارند.
                فقط یک چیز وجود دارد که هر فرهنگ ، دین و کشور در جهان با آن موافق است؟و این است که فقط هفت روز در هفته وجود دارد.نه یک مورد دیگر یا نه"
                    author="ممد کاظم"
                />

                <p className="mt-4 text-sm text-black/80">
                    وارد بابل ها شوید.این جامعه باستان ، که در بین النهرین در عراق زندگی می کرد ، چرخه ماه را تا 28 روز دور می کرد و این مدت زمان را به 4 دوره 7 روز تقسیم می کرد و از روزهای جهش برای همگام سازی با مراحل ماه در طولانی مدت استفاده می کردواداین ساختار 7 روزه همچنین اعتقاد بر این است که در نهایت تعدادی از اسطوره های آفرینش محبوب مانند کتاب پیدایش در کتاب مقدس عبری و مسیحی را آگاه کرده است ، که بیان می کند که خداوند جهان را در هفت روز ایجاد کرده است: شش روز کار به دنبال آن یکروز استراحت.
                </p>

                <div className="space-y-5">
                    <h2 className="text-xl font-medium">
                        ⚪آخر هفته کی است؟
                    </h2>

                    <p className="mt-4 text-sm text-black/80">
                        از آنجا که روز اول هفته در فرهنگ های مختلف متفاوت است ، آخر هفته نیز چنین می شود.دنیای مسیحی یا غربی یکشنبه به عنوان روز استراحت و عبادت آنها مشخص می شود ، در حالی که مسلمانان روز جمعه را به عنوان روز استراحت و نماز خود یاد می کنند.تقویم یهود شنبه - سبت - به عنوان روز استراحت و عبادت حساب می شود.هر دو شنبه و یکشنبه روزهای مشترک استراحت در تقویم است.تقویم ها در برخی از کشورها از رنگ جداگانه برای آخر هفته استفاده می کنند و فونت های سیاه یا خاکستری را برای روزهای هفته ، دوشنبه تا جمعه رزرو می کنند.
                    </p>
                </div>
            </div>

            <div className="mt-20 px-container">
                <SimilarArticles
                    title="مقالات مرتبط"
                    subTitle="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است"
                />
            </div>

            <div className="mt-20">
                <Footer />
            </div>
        </div>
    )
}

export default ArticleDetail